""""
Уявимо що до нас прийшов наш друг або подруга і попросили написати додаток для покупок в магазині
що б можна було скласти список продуктів та коли купуєш викреслювати(для викреслення питайте номер елемента,
що б видалити по індексу треба його передати в pop list_a.pop(0) - видалить нульовий індекс,
пам'ятайте що користувач не знає що в нас індекси починаються з нуля)
Також нам відомо що цей список має пять або більше елементів.
Після кожного видалення елементу виводьте наш оновлений список.
Після 5 видалень перевірте чи список пустий якщо не пустий напишіть що ось ще є продукти, якщо пусти то напишіть про це.
Також після цього кроку запропонуйте користувачу написати ще продуктів та додати його в кошик. і виведіть їх на екран.
Але цього разу вже без видалень.
кроки:

- Спочатку пропонуємо користувачу ввести продукти.
- Робимо 5 запитів на видалення
- Перевіряємо корзину
- Пропонуємо додати продукти
- Виводимо список і прощаємось
"""

shopping_cart = []

# Запит користувача ввести всі продукти в одну строку
products_input = input("Введіть всі продукти через кому: ")

# Розділення введених продуктів у список
products_list = products_input.split(',')

# Додавання продуктів до списку
shopping_cart.extend(products_list)

# Виведення початкового списку продуктів
print("Список продуктів:", shopping_cart)

for i in range(5):
    # Показуємо поточний список і запитуємо користувача про індекс для видалення
    print("Поточний список продуктів:", shopping_cart)
    index_to_remove = int(input("Введіть індекс продукта для видалення: "))

    # Перевірка, чи індекс знаходиться в межах списку
    if 0 <= index_to_remove < (len(shopping_cart) + 1):
        removed_item = shopping_cart.pop(index_to_remove - 1)
        print(f"Видалено: {removed_item}")
    else:
        print("Неправильний індекс. Спробуйте ще раз.")
    # Сповіщення про те, що список порожній

# Виведення остаточного списку продуктів
print("Остаточний список продуктів:", shopping_cart)

# Пропонуємо користувачу додати нові продукти
print("Тепер ви можете додати нові продукти:")
while True:
    new_product = input("Введіть новий продукт (або 'exit', щоб завершити): ")
    if new_product.lower() == 'exit':
        break
    else:
        shopping_cart.append(new_product)

# Виведення оновленого списку продуктів після додавання нових елементів
print("Оновлений список продуктів:", shopping_cart)
print("Дякую що скористались нашим додатком")

