# 9 Теорема Піфагора:
# Запитайте у користувача довжини катетів та виведіть на екран довжину гіпотенузи.
# Трикутник рівнобедрений. Що б взвести в степінь ставимо два рази множення
# два в степені три буде так 2**3, квадратний корінь з двух буде 2**(1/2)
# Запитайте у користувача довжини катетів

# Функція що приймає значення двох катетів та повертає чому дорівнює гіпотенуза
def calculate_hypotenuse(leg_1: int | float, leg_2: int | float):
    hypotenuse = (leg_1 ** 2 + leg_2 ** 2) ** (1 / 2)
    return (f'Довжина гіпотенузи рівнобедреного '
            f'трикутника з катетами {leg_1} і {leg_2} дорівнює {round(hypotenuse, 2)}')


# Напишіть функцію "Касир в кінотеатрі", яка попросить користувача ввести свій вік
# (можна використати константу або функцію input(), на екран має бути виведено лише одне повідомлення).
# - якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"
# - якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
# - якщо від 16 до 65 то зробіть якесь вітальне повідомлення, на ваш розсуд.
# - якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!"

# Функція що приймає вік відвідувача кінотеатру та обробляє який меседж повернути при обробці його віку
def cinema_cashier(age: int):
    if age <= 7:
        return f'Де твої батьки? Це, мабуть, ще один мультфільм!'
    elif age <= 16:
        return f'Це фільм для дорослих! Нам потрібно перевірити твоє посвідчення.'
    elif 16 <= age < 65:
        return f'Вітаємо на сеансі! Насолоджуйтесь фільмом, і не забудьте попкорн!'
    else:
        return f'Покажіть пенсійне посвідчення! Можливо, у нас є знижки для вас.'


# Приклад роботи функцій
if __name__ == '__main__':
    print(cinema_cashier(8))
    print(calculate_hypotenuse(3, 7.8))
